7767517
139 156
Input            0                        0 1 0
Convolution      316                      1 1 0 316 0=16 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=432
HardSwish        323                      1 1 316 323 0=1.666667e-01 1=5.000000e-01
Convolution      324                      1 1 323 324 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
ReLU             326                      1 1 324 326
ConvolutionDepthWise 327                      1 1 326 327 0=16 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=144 7=16
ReLU             329                      1 1 327 329
Convolution      330                      1 1 329 330 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
Split            splitncnn_0              1 2 330 330_splitncnn_0 330_splitncnn_1
Pooling          332                      1 1 330_splitncnn_1 332 0=1 4=1
Convolution      333                      1 1 332 333 0=4 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=64
ReLU             335                      1 1 333 335
Convolution      336                      1 1 335 336 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=64
HardSigmoid      342                      1 1 336 342 0=1.666667e-01 1=5.000000e-01
BinaryOp         343                      2 1 330_splitncnn_0 342 343 0=2
Convolution      344                      1 1 343 344 0=72 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1152
ReLU             346                      1 1 344 346
ConvolutionDepthWise 347                      1 1 346 347 0=72 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=648 7=72
ReLU             349                      1 1 347 349
Convolution      350                      1 1 349 350 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1728
Split            splitncnn_1              1 2 350 350_splitncnn_0 350_splitncnn_1
Convolution      352                      1 1 350_splitncnn_1 352 0=88 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2112
ReLU             354                      1 1 352 354
ConvolutionDepthWise 355                      1 1 354 355 0=88 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=792 7=88
ReLU             357                      1 1 355 357
Convolution      358                      1 1 357 358 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2112
BinaryOp         360                      2 1 358 350_splitncnn_0 360 0=0
Convolution      361                      1 1 360 361 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
HardSwish        368                      1 1 361 368 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise 369                      1 1 368 369 0=96 1=5 11=5 2=1 12=1 3=2 13=2 4=2 14=2 15=2 16=2 5=1 6=2400 7=96
HardSwish        376                      1 1 369 376 0=1.666667e-01 1=5.000000e-01
Convolution      377                      1 1 376 377 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3840
Split            splitncnn_2              1 2 377 377_splitncnn_0 377_splitncnn_1
Pooling          379                      1 1 377_splitncnn_1 379 0=1 4=1
Convolution      380                      1 1 379 380 0=10 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=400
ReLU             382                      1 1 380 382
Convolution      383                      1 1 382 383 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=400
HardSigmoid      389                      1 1 383 389 0=1.666667e-01 1=5.000000e-01
BinaryOp         390                      2 1 377_splitncnn_0 389 390 0=2
Split            splitncnn_3              1 2 390 390_splitncnn_0 390_splitncnn_1
Convolution      391                      1 1 390_splitncnn_1 391 0=240 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9600
HardSwish        398                      1 1 391 398 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise 399                      1 1 398 399 0=240 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=6000 7=240
HardSwish        406                      1 1 399 406 0=1.666667e-01 1=5.000000e-01
Convolution      407                      1 1 406 407 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9600
Split            splitncnn_4              1 2 407 407_splitncnn_0 407_splitncnn_1
Pooling          409                      1 1 407_splitncnn_1 409 0=1 4=1
Convolution      410                      1 1 409 410 0=10 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=400
ReLU             412                      1 1 410 412
Convolution      413                      1 1 412 413 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=400
HardSigmoid      419                      1 1 413 419 0=1.666667e-01 1=5.000000e-01
BinaryOp         420                      2 1 407_splitncnn_0 419 420 0=2
BinaryOp         421                      2 1 420 390_splitncnn_0 421 0=0
Split            splitncnn_5              1 2 421 421_splitncnn_0 421_splitncnn_1
Convolution      422                      1 1 421_splitncnn_1 422 0=240 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9600
HardSwish        429                      1 1 422 429 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise 430                      1 1 429 430 0=240 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=6000 7=240
HardSwish        437                      1 1 430 437 0=1.666667e-01 1=5.000000e-01
Convolution      438                      1 1 437 438 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9600
Split            splitncnn_6              1 2 438 438_splitncnn_0 438_splitncnn_1
Pooling          440                      1 1 438_splitncnn_1 440 0=1 4=1
Convolution      441                      1 1 440 441 0=10 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=400
ReLU             443                      1 1 441 443
Convolution      444                      1 1 443 444 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=400
HardSigmoid      450                      1 1 444 450 0=1.666667e-01 1=5.000000e-01
BinaryOp         451                      2 1 438_splitncnn_0 450 451 0=2
BinaryOp         452                      2 1 451 421_splitncnn_0 452 0=0
Split            splitncnn_7              1 2 452 452_splitncnn_0 452_splitncnn_1
Convolution      453                      1 1 452_splitncnn_1 453 0=120 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4800
HardSwish        460                      1 1 453 460 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise 461                      1 1 460 461 0=120 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=3000 7=120
HardSwish        468                      1 1 461 468 0=1.666667e-01 1=5.000000e-01
Convolution      469                      1 1 468 469 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=5760
Split            splitncnn_8              1 2 469 469_splitncnn_0 469_splitncnn_1
Pooling          471                      1 1 469_splitncnn_1 471 0=1 4=1
Convolution      472                      1 1 471 472 0=12 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=576
ReLU             474                      1 1 472 474
Convolution      475                      1 1 474 475 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=576
HardSigmoid      481                      1 1 475 481 0=1.666667e-01 1=5.000000e-01
BinaryOp         482                      2 1 469_splitncnn_0 481 482 0=2
Convolution      483                      1 1 452_splitncnn_0 483 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1920
BinaryOp         485                      2 1 482 483 485 0=0
Split            splitncnn_9              1 2 485 485_splitncnn_0 485_splitncnn_1
Convolution      486                      1 1 485_splitncnn_1 486 0=144 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6912
HardSwish        493                      1 1 486 493 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise 494                      1 1 493 494 0=144 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=3600 7=144
HardSwish        501                      1 1 494 501 0=1.666667e-01 1=5.000000e-01
Convolution      502                      1 1 501 502 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6912
Split            splitncnn_10             1 2 502 502_splitncnn_0 502_splitncnn_1
Pooling          504                      1 1 502_splitncnn_1 504 0=1 4=1
Convolution      505                      1 1 504 505 0=12 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=576
ReLU             507                      1 1 505 507
Convolution      508                      1 1 507 508 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=576
HardSigmoid      514                      1 1 508 514 0=1.666667e-01 1=5.000000e-01
BinaryOp         515                      2 1 502_splitncnn_0 514 515 0=2
BinaryOp         516                      2 1 515 485_splitncnn_0 516 0=0
Split            splitncnn_11             1 2 516 516_splitncnn_0 516_splitncnn_1
Convolution      517                      1 1 516_splitncnn_1 517 0=288 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=13824
HardSwish        524                      1 1 517 524 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise 525                      1 1 524 525 0=288 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=7200 7=288
HardSwish        532                      1 1 525 532 0=1.666667e-01 1=5.000000e-01
Convolution      533                      1 1 532 533 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=27648
Split            splitncnn_12             1 2 533 533_splitncnn_0 533_splitncnn_1
Pooling          535                      1 1 533_splitncnn_1 535 0=1 4=1
Convolution      536                      1 1 535 536 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             538                      1 1 536 538
Convolution      539                      1 1 538 539 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
HardSigmoid      545                      1 1 539 545 0=1.666667e-01 1=5.000000e-01
BinaryOp         546                      2 1 533_splitncnn_0 545 546 0=2
Convolution      547                      1 1 516_splitncnn_0 547 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4608
BinaryOp         549                      2 1 546 547 549 0=0
Split            splitncnn_13             1 2 549 549_splitncnn_0 549_splitncnn_1
Convolution      550                      1 1 549_splitncnn_1 550 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
HardSwish        557                      1 1 550 557 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise 558                      1 1 557 558 0=576 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=14400 7=576
HardSwish        565                      1 1 558 565 0=1.666667e-01 1=5.000000e-01
Convolution      566                      1 1 565 566 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
Split            splitncnn_14             1 2 566 566_splitncnn_0 566_splitncnn_1
Pooling          568                      1 1 566_splitncnn_1 568 0=1 4=1
Convolution      569                      1 1 568 569 0=4 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=64
ReLU             571                      1 1 569 571
Convolution      572                      1 1 571 572 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=64
HardSigmoid      578                      1 1 572 578 0=1.666667e-01 1=5.000000e-01
BinaryOp         579                      2 1 566_splitncnn_0 578 579 0=2
Convolution      580                      1 1 549_splitncnn_0 580 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1536
BinaryOp         582                      2 1 579 580 582 0=0
Split            splitncnn_15             1 2 582 582_splitncnn_0 582_splitncnn_1
Pooling          584                      1 1 582_splitncnn_1 584 0=1 1=14 11=14 2=14 12=14 3=0 13=0 14=0 15=0 5=1 6=0
Reshape          592                      1 1 584 592 0=-1
Convolution      593                      1 1 582_splitncnn_0 593 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=4608
HardSwish        600                      1 1 593 600 0=1.666667e-01 1=5.000000e-01
Split            splitncnn_16             1 2 600 600_splitncnn_0 600_splitncnn_1
Pooling          602                      1 1 600_splitncnn_1 602 0=1 1=7 11=7 2=7 12=7 3=0 13=0 14=0 15=0 5=1 6=0
Reshape          610                      1 1 602 610 0=-1
Convolution      611                      1 1 600_splitncnn_0 611 0=128 1=7 11=7 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=200704
ReLU             612                      1 1 611 612
Reshape          620                      1 1 612 620 0=-1
Concat           621                      3 1 592 610 620 621 0=0
InnerProduct     622                      1 1 621 622 0=136 1=1 2=23936
